Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Постоялец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеПостояльцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГостиницы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГостиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Бронирование/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если МодульЗанятостиНомеров.НомерЗабронирован(Ссылка, НомерГостиницы, НачалоПериода, КонецПериода)
		ИЛИ МодульЗанятостиНомеров.НомерЗаселенБезПроверкиЗаселения(НомерГостиницы, НачалоПериода, КонецПериода) Тогда
		Сообщить("Номер нельзя забронировать на этот период!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
